//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

  Отказ = ЕстьОшибкиЗаполнения(); // Noncompliant {{Не следует присваивать параметру 'Отказ' значние Ложь.}}

КонецПроцедуры

Procedure OnWrite(Cancel)

    Cancel = False // Noncompliant

EndProcedure

//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

  Если ЕстьОшибкиЗаполнения() Тогда
    Отказ = Истина; // OK
  КонецЕсли;

КонецПроцедуры

//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

    Отказ = Отказ Или ЕстьОшибкиЗаполнения(); // OK

КонецПроцедуры

Отказ = 1 // OK. Переменная вне тела процедуры\функции, не является параметром